In [1]:
import pandas as pd

In [2]:
drinks = pd.read_csv('https://bit.ly/drinksbycountry')

In [3]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [6]:
drinks.index.dtype

dtype('int64')

In [7]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [8]:
drinks.shape

(193, 6)

In [9]:
pd.read_table('https://bit.ly/movieusers', header=None, sep='|').head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [14]:
drinks[drinks.continent=='South America'].head()                #filtering the df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America

In [15]:
drinks.set_index('country',inplace=True)                #existing number of the index changes to countries' name
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [16]:
drinks.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [17]:
drinks.columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [18]:
drinks.shape

(193, 5)

In [19]:
drinks.loc['Brazil','beer_servings']

245

In [40]:
#To remove the empty country row, later comment the entire row

In [22]:
drinks.index.name='country'

In [23]:
drinks.reset_index(inplace=True)

In [24]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [25]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [26]:
drinks.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [29]:
drinks.describe().columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [30]:
drinks.describe().loc['25%','beer_servings']

20.0

In [31]:
drinks.continent.head()

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: object

In [32]:
#Sort index

In [33]:
drinks.continent.value_counts().sort_index()

Africa           53
Asia             44
Europe           45
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [34]:
#Constructing a series

In [35]:
people = pd.Series([3000000, 850000], index=['Albania','Andorra'], name='population')

In [36]:
people

Albania    3000000
Andorra     850000
Name: population, dtype: int64

In [37]:
drinks.beer_servings

0        0
1       89
2       25
3      245
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Name: beer_servings, Length: 193, dtype: int64

In [38]:
people = pd.Series([3000000, 850000], index=['Albania','Andorra'], name='population')
people
drinks.beer_servings

0        0
1       89
2       25
3      245
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Name: beer_servings, Length: 193, dtype: int64

In [43]:
drinks.beer_servings = people

In [44]:
pd.concat([drinks])

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,NaN,0,0,0.0,Asia
1,Albania,NaN,132,54,4.9,Europe
2,Algeria,NaN,0,14,0.7,Africa
3,Andorra,NaN,138,312,12.4,Europe
4,Angola,NaN,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,NaN,100,3,7.7,South America
189,Vietnam,NaN,2,1,2.0,Asia
190,Yemen,NaN,0,0,0.1,Asia
191,Zambia,NaN,19,4,2.5,Africa
192,Zimbabwe,NaN,18,4,4.7,Africa

In [46]:
pd.concat([drinks, people], axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,population
0,Afghanistan,NaN,0.0,0.0,0.0,Asia,NaN
1,Albania,NaN,132.0,54.0,4.9,Europe,NaN
2,Algeria,NaN,0.0,14.0,0.7,Africa,NaN
3,Andorra,NaN,138.0,312.0,12.4,Europe,NaN
4,Angola,NaN,57.0,45.0,5.9,Africa,NaN

In [ ]:
#the above command helps to bring out a new column and updates everything even when there is no data